Llerr/Clock-on-STM32/Core/Src/Screens.c
    saveBrightness,           // Краткое нажатие средней кнопки
    showMenu,                 // Долгое нажатие средней кнопки
    buttonReceiverBrightEdit, // Обработчик кнопок в этом пункте
    2,
    {&textEditBright32, &textIllum}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuTime =
{
    stateMenuTime,
    NULL, //blink

    &screenMenuTime,  // Право
    &screenMain1,  // Лево
    &screenMenuTime,  // вверх
    &screenMenuDate,  // вниз
    &screenMain1,  // Долгое нажатие влево

    &screenMain1, // кнопка set

    selectMenuTime,      // Краткое нажатие центр
    midStub,             // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTimeSel, &textMenuDate, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDate =
{
    stateMenuDate,
    NULL, //blink

    &screenMenuDate, // Право
    &screenMenuDate, // Лево
    &screenMenuTime, // вверх
    &screenMenuAlarm, // вниз
    &screenMain1,

    &screenMain1, // кнопка set

    selectMenuDate,   // Краткое нажатие средней кнопки
    midStub,          // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDateSel, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlarm =
{
    stateMenuAlarm,
    NULL, //blink

    &screenMenuAlr0,
    &screenMenuAlarm,
    &screenMenuDate,
    &screenMenuBrightness,
    &screenMain1,

    &screenMain1, // кнопка set

    midStub,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDate, &textMenuAlrSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuBrightness =
{
    stateMenuBrightness,
    NULL, //blink

    &screenMenuBrightness,
    &screenMenuBrightness,
    &screenMenuAlarm,
    &screenMenuBrightness,
    &screenMain1,       //Долгое нажатие влево

    &screenMain1, // кнопка set

    inBrightness,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
   1,
    {&textMenuBrightSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr0 =
{
    stateMenuAlarm1,
    NULL, //blink

    &screenMenuAlr0,
    &screenMenuAlarm,
    &screenMenuAlr0,
    &screenMenuAlr1,
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,     // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr1 =
{
    stateMenuAlarm2,
    NULL, //blink

    &screenMenuAlr1,
    &screenMenuAlarm,
    &screenMenuAlr0,
    &screenMenuAlr2,
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr2 =
{
    stateMenuAlarm3,
    NULL, //blink

    &screenMenuAlr2,
    &screenMenuAlarm,
    &screenMenuAlr1,
    &screenMenuAlr2,
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditTime =
{
    stateTimeEdit,
    &textBlinkTimeEdit, //blink

    &screenEditTime,
    &screenEditTime,
    &screenEditTime,
    &screenEditTime,
    &screenMenuTime,

    &screenEditTime, // кнопка set (В режиме редактирования не используется)

    saveTime,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverTimeEdit, // Обработчик кнопок в этом пункте
    1,
    {&textTimeEdit}
};


//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditAlarm =
{
    stateAlarmEdit,
    &textBlinkTimeEdit, //blink

    &screenEditAlarm,
    &screenEditAlarm,
    &screenEditAlarm,
    &screenEditAlarm,
    &screenMenuAlr0,

    &screenEditAlarm, // кнопка set (В режиме редактирования не используется)

    saveAlarm,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverAlarmEdit, // Обработчик кнопок в этом пункте
    4,
    {&textTimeEdit, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditDate =
{
    stateDateEdtit,
    &textBlink32, //blink

    &screenEditDate,
    &screenEditDate,
    &screenEditDate,
    &screenEditDate,
    &screenMenuTime,

    &screenMenuTime, // кнопка set

    saveDate,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverDateEdit, // Обработчик кнопок в этом пункте
    1,
    {&textEdit32}
};

